In [1]:
import pandas as pd
import numpy as np

In [2]:
people = pd.DataFrame(np.random.randn(5,5),
                     columns= 'a b c d e'.split(),
                     index=['Joao', 'Anna', 'Carlos', 'Wes', 'Travis'])

In [3]:
people.iloc[2:3, [1,2]] = np.nan

In [4]:
people

               a         b         c         d         e
Joao    1.297462 -0.079104 -2.129746 -1.425414  1.836601
Anna    0.195247 -1.261818 -1.374009 -0.556905  0.432845
Carlos -1.054948       NaN       NaN  0.794853  0.033297
Wes     0.752738 -1.601173  0.875036  0.462388 -0.217931
Travis -0.695776 -0.302025  0.050919  0.358044  0.636181

In [5]:
mapping = {'a':'red', 'b':'red', 'c':'blue', 
           'd':'blue', 'e':'red', 'f':'orange'}

In [6]:
by_column = people.groupby(mapping, axis=1)

In [7]:
by_column.sum()

            blue       red
Joao   -3.555159  3.054959
Anna   -1.930914 -0.633725
Carlos  0.794853 -1.021651
Wes     1.337425 -1.066366
Travis  0.408963 -0.361621

In [8]:
map_series = pd.Series(mapping)

map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [9]:
people.groupby(map_series, axis=1).count()

        blue  red
Joao       2    3
Anna       2    3
Carlos     1    2
Wes        2    3
Travis     2    3

In [10]:
people

               a         b         c         d         e
Joao    1.297462 -0.079104 -2.129746 -1.425414  1.836601
Anna    0.195247 -1.261818 -1.374009 -0.556905  0.432845
Carlos -1.054948       NaN       NaN  0.794853  0.033297
Wes     0.752738 -1.601173  0.875036  0.462388 -0.217931
Travis -0.695776 -0.302025  0.050919  0.358044  0.636181

# Using functions

In [11]:
people.groupby(len).sum()

          a         b         c         d         e
3  0.752738 -1.601173  0.875036  0.462388 -0.217931
4  1.492709 -1.340922 -3.503754 -1.982319  2.269446
6 -1.750724 -0.302025  0.050919  1.152897  0.669478

In [12]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [13]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 two  0.752738 -1.601173  0.875036  0.462388 -0.217931
4 one  0.195247 -1.261818 -2.129746 -1.425414  0.432845
6 one -1.054948       NaN       NaN  0.794853  0.033297
  two -0.695776 -0.302025  0.050919  0.358044  0.636181

# Groupping by index

In [23]:
columns = pd.MultiIndex.from_arrays([['US','US','US','JP','JP'],
                                    [1,3,5,1,3]],
                                    names= ['cty', 'tenor'])

In [24]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [25]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.088801 -0.627524  1.518470  1.117872 -0.431804
1     -0.048216  0.969410 -0.309785 -0.858131 -0.124131
2     -1.185604 -0.247846 -0.330389 -0.393020  2.664847
3      0.356931 -1.983711  0.704141 -0.975358  0.338705

In [26]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [37]:
df

NameError: name 'df' is not defined